"""
UNION ARENA カードデータ関連の定数定義
"""

# カードセット（card_rank）の定義
CARD_RANKS = [
    "UAPR", "UA02ST",
    'EX01BT', 'EX02BT', 'EX03BT', 'EX04BT', 'EX05BT', 'EX06BT', 'EX07BT', 'EX08BT',
    "UA01BT", "UA02BT", "UA03BT", "UA04BT", "UA05BT", "UA06BT", "UA07BT", "UA08BT", "UA09BT", "UA10BT",
    "UA11BT", "UA12BT", "UA13BT", "UA14BT", "UA15BT", "UA16BT", "UA17BT", "UA18BT", "UA19BT", "UA20BT",
    "UA21BT", "UA22BT", "UA23BT", "UA24BT", "UA25BT", "UA26BT", "UA27BT", "UA28BT", "UA29BT", "UA30BT",
     "UA31BT", "UA32BT", "UA33BT", "UA34BT", "UA35BT", "UA36BT", "UA37BT", "UA38BT","UA39BT",
    "UA01PC", "UA02PC", "UA02NC", "UA01NC"
]

# カードシリーズ（作品）（card_term）の定義
CARD_TERMS = [
    "CGH", "HTR", "JJK", "IMS", "KMY", "TOA", "TSK", "BLC", "BTR", "MHA",
    "GNT", "BLK", "TKN", "DST", "SAO", "SYN", "TRK", "NIK", "HIQ", "BCV",
    "YYH", "GMR", "AOT", "SHY", "AND", "RLY", "GIM", "KJ8", "KMR", "WBK",
    "SNF","KIN","HIQ"
]

# カードシリーズの日本語名マッピング
CARD_TERM_NAMES = {
    "HIQ": "ハイキュー",
    "CGH": "コードギアス",
    "HTR": "HUNTER×HUNTER",
    "JJK": "呪術廻戦",
    "IMS": "アイドルマスター",
    "KMY": "鬼滅の刃",
    "TOA": "刀剣乱舞",
    "TSK": "月姫",
    "BLC": "ブラッククローバー",
    "BTR": "バトルスピリッツ",
    "MHA": "僕のヒーローアカデミア",
    "GNT": "銀魂",
    "BLK": "BLEACH",
    "TKN": "東京喰種",
    "DST": "デスノート",
    "SAO": "ソードアート・オンライン",
    "SYN": "サイバーパンク",
    "TRK": "進撃の巨人",
    "NIK": "ニセコイ",
    "HIQ": "ヒカルの碁",
    "BCV": "バカとテストと召喚獣",
    "YYH": "幽☆遊☆白書",
    "GMR": "ガメラ",
    "AOT": "進撃の巨人",
    "SHY": "SHY",
    "AND": "アンダーテール",
    "RLY": "リライフ",
    "GIM": "銀魂",
    "KJ8": "境界のRINNE",
    "KMR": "カミヨミ",
    "WBK": "ワールドトリガー",
    "SNF":"シャングリラフロンティア",
    "KIN":"キン肉マン"
}

# カードセットの日本語名マッピング
CARD_RANK_NAMES = {
    "UA02ST": "スターターデッキ呪術廻戦",
    "UAPR": "プロモーションカード",
    "EX01BT": "エクストラセット01",
    "EX02BT": "エクストラセット02",
    "EX03BT": "エクストラセット03",
    "EX04BT": "エクストラセット04",
    "EX05BT": "エクストラセット05",
    "EX06BT": "エクストラセット06",
    "EX07BT": "エクストラセット07",
    "EX08BT": "エクストラセット08",
    "UA01BT": "メインセット01",
    "UA02BT": "メインセット02",
    "UA03BT": "メインセット03",
    "UA04BT": "メインセット04",
    "UA05BT": "メインセット05",
    "UA06BT": "メインセット06",
    "UA07BT": "メインセット07",
    "UA08BT": "メインセット08",
    "UA09BT": "メインセット09",
    "UA10BT": "メインセット10",
    "UA11BT": "メインセット11",
    "UA12BT": "メインセット12",
    "UA13BT": "メインセット13",
    "UA14BT": "メインセット14",
    "UA15BT": "メインセット15",
    "UA16BT": "メインセット16",
    "UA17BT": "メインセット17",
    "UA18BT": "メインセット18",
    "UA19BT": "メインセット19",
    "UA20BT": "メインセット20",
    "UA21BT": "メインセット21",
    "UA22BT": "メインセット22",
    "UA23BT": "メインセット23",
    "UA24BT": "メインセット24",
    "UA25BT": "メインセット25",
    "UA26BT": "メインセット26",
    "UA27BT": "メインセット27",
    "UA28BT": "メインセット28",
    "UA29BT": "メインセット29",
    "UA30BT": "メインセット30",
    "UA31BT": "メインセット31",
    "UA32BT": "メインセット32",
    "UA33BT": "メインセット33",
    "UA34BT": "メインセット34",
    "UA35BT": "メインセット35",
    "UA36BT": "メインセット36",
    "UA37BT": "メインセット37",
    "UA38BT": "メインセット38",
    "UA39BT": "メインセット39",
    "UA01PC": "PC版セット01",
    "UA02PC": "PC版セット02",
    "UA01NC": "NC版セット01",
    "UA02NC": "NC版セット02",
}

 